In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\hp\anaconda3\lib\site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2.3.5)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hp\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\hp\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [46]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [9]:
number_df= DataFrame(np.arange(0,90, 3).reshape(10,3), index=['row1','row2','row3','row4','row5','row6','row7','row8','row9','row10'],
columns=['cloumn1', 'column2','column3'])

number_df

       cloumn1  column2  column3
row1         0        3        6
row2         9       12       15
row3        18       21       24
row4        27       30       33
row5        36       39       42
row6        45       48       51
row7        54       57       60
row8        63       66       69
row9        72       75       78
row10       81       84       87

In [12]:
number_df.iloc[7,2]

np.int64(69)

In [13]:
number_df.iloc[7,2]= 20
number_df

       cloumn1  column2  column3
row1         0        3        6
row2         9       12       15
row3        18       21       24
row4        27       30       33
row5        36       39       42
row6        45       48       51
row7        54       57       60
row8        63       66       20
row9        72       75       78
row10       81       84       87

In [14]:
#fancy indexing
number_df.iloc[[1,2,4],[1,2]] # first bloc is for rows and and second one is for cols

      column2  column3
row2       12       15
row3       21       24
row5       39       42

In [18]:
#boolean indexing
state= number_df>30 # varibae name= datafram name and condition
state

       cloumn1  column2  column3
row1     False    False    False
row2     False    False    False
row3     False    False    False
row4     False    False     True
row5      True     True     True
row6      True     True     True
row7      True     True     True
row8      True     True    False
row9      True     True     True
row10     True     True     True

In [21]:
number_df[state]

       cloumn1  column2  column3
row1       NaN      NaN      NaN
row2       NaN      NaN      NaN
row3       NaN      NaN      NaN
row4       NaN      NaN     33.0
row5      36.0     39.0     42.0
row6      45.0     48.0     51.0
row7      54.0     57.0     60.0
row8      63.0     66.0      NaN
row9      72.0     75.0     78.0
row10     81.0     84.0     87.0

In [22]:
number_df[number_df>30]=0
number_df

       cloumn1  column2  column3
row1         0        3        6
row2         9       12       15
row3        18       21       24
row4        27       30        0
row5         0        0        0
row6         0        0        0
row7         0        0        0
row8         0        0       20
row9         0        0        0
row10        0        0        0

In [23]:
#slicing values
number_df.iloc[2:6, 1:3] # giving the row range and col range

      column2  column3
row3       21       24
row4       30        0
row5        0        0
row6        0        0

In [27]:
#missing values in python
#by default, missing values are represented with NaN,"not a number"
data={'names':['yash', 'micheal','josh','abrish', 'kunal', 'Amit'],
     'age':[20,22,23,25,26,24],
     'gender':['male','male','male','male','male','male'],
     'rank':[2,3,4,5,6,7]}
ranking_df= DataFrame(data)
ranking_df.iloc[2:5, 1]=np.nan
ranking_df.iloc[3:6, 3]=np.nan
ranking_df.iloc[3,:]=np.nan
ranking_df

     names   age gender  rank
0     yash  20.0   male   2.0
1  micheal  22.0   male   3.0
2     josh   NaN   male   4.0
3      NaN   NaN    NaN   NaN
4    kunal   NaN   male   NaN
5     Amit  24.0   male   NaN

In [28]:
#handling missing values
ranking_df.isnull()

   names    age  gender   rank
0  False  False   False  False
1  False  False   False  False
2  False   True   False  False
3   True   True    True   True
4  False   True   False   True
5  False  False   False   True

In [29]:
ranking_df.notnull()

   names    age  gender   rank
0   True   True    True   True
1   True   True    True   True
2   True  False    True   True
3  False  False   False  False
4   True  False    True  False
5   True   True    True  False

In [30]:
bool_series=pd.isnull(ranking_df['age'])
ranking_df[bool_series]# it will return only those values who's ahe is null

   names  age gender  rank
2   josh  NaN   male   4.0
3    NaN  NaN    NaN   NaN
4  kunal  NaN   male   NaN

In [31]:
ranking_df.fillna(0)

     names   age gender  rank
0     yash  20.0   male   2.0
1  micheal  22.0   male   3.0
2     josh   0.0   male   4.0
3        0   0.0      0   0.0
4    kunal   0.0   male   0.0
5     Amit  24.0   male   0.0

In [33]:
ranking_df.fillna(method='pad') # this will replace the null values with it's prior values

C:\Users\HP\AppData\Local\Temp\ipykernel_26376\2647120121.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  ranking_df.fillna(method='pad')

     names   age gender  rank
0     yash  20.0   male   2.0
1  micheal  22.0   male   3.0
2     josh  22.0   male   4.0
3     josh  22.0   male   4.0
4    kunal  22.0   male   4.0
5     Amit  24.0   male   4.0

In [34]:
ranking_df.fillna(method='bfill') # null values will be flled with the post values with it

C:\Users\HP\AppData\Local\Temp\ipykernel_26376\3253257716.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  ranking_df.fillna(method='bfill')

     names   age gender  rank
0     yash  20.0   male   2.0
1  micheal  22.0   male   3.0
2     josh  24.0   male   4.0
3    kunal  24.0   male   NaN
4    kunal  24.0   male   NaN
5     Amit  24.0   male   NaN

In [36]:
ranking_df.interpolate(method='linear') # lineraly increase the  numerical values

C:\Users\HP\AppData\Local\Temp\ipykernel_26376\4007689601.py:1: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  ranking_df.interpolate(method='linear')

     names   age gender  rank
0     yash  20.0   male   2.0
1  micheal  22.0   male   3.0
2     josh  22.5   male   4.0
3      NaN  23.0    NaN   4.0
4    kunal  23.5   male   4.0
5     Amit  24.0   male   4.0

In [37]:
ranking_df.dropna() # all which has null values there field are droped

     names   age gender  rank
0     yash  20.0   male   2.0
1  micheal  22.0   male   3.0

In [38]:
ranking_df.dropna(how='all') # this drops the null values which has all field null

     names   age gender  rank
0     yash  20.0   male   2.0
1  micheal  22.0   male   3.0
2     josh   NaN   male   4.0
4    kunal   NaN   male   NaN
5     Amit  24.0   male   NaN

In [41]:
ranking_df.dropna(axis=1)# this will drop the values whos rows vlaues are missing

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [43]:
ranking_df.dropna(axis=0)# this will drop the values whos cols vlaues are missing

     names   age gender  rank
0     yash  20.0   male   2.0
1  micheal  22.0   male   3.0

In [48]:
#removing deplcates
df_obj= DataFrame({'colum1':[1,1,2,2,3,3,3],
'column2':['a','a','b','b','c','c','c'],
'column3':['A','A','B','B','C','C','C']})
df_obj

   colum1 column2 column3
0       1       a       A
1       1       a       A
2       2       b       B
3       2       b       B
4       3       c       C
5       3       c       C
6       3       c       C

In [49]:
df_obj.duplicated()

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

In [51]:
df_obj.drop_duplicates()

   colum1 column2 column3
0       1       a       A
2       2       b       B
4       3       c       C

In [52]:
df_obj= DataFrame({'colum1':[1,1,2,2,3,3,3],
'column2':['a','a','b','b','c','c','c'],
'column3':['A','A','B','B','C','D','C']})
df_obj

   colum1 column2 column3
0       1       a       A
1       1       a       A
2       2       b       B
3       2       b       B
4       3       c       C
5       3       c       D
6       3       c       C

In [56]:
df_obj.drop_duplicates(['column3'])

   colum1 column2 column3
0       1       a       A
2       2       b       B
4       3       c       C
5       3       c       D

In [57]:
df_obj.drop_duplicates()

   colum1 column2 column3
0       1       a       A
2       2       b       B
4       3       c       C
5       3       c       D

In [59]:
#Comcatenting Data: when you cancatenate your data, you create new datasets by combing data from seperate, distinct sources.
#you often need to combine DataFrames so you can analyze data from a mixture of sources. You can combine DataFrames usinf  a shared index value by calling the pd.concat() function
df_obj_new= DataFrame(np.arange(36).reshape(6,6))
df_obj_new

    0   1   2   3   4   5
0   0   1   2   3   4   5
1   6   7   8   9  10  11
2  12  13  14  15  16  17
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [60]:
df_obj1= DataFrame(np.arange(15).reshape(5,3))
df_obj1

    0   1   2
0   0   1   2
1   3   4   5
2   6   7   8
3   9  10  11
4  12  13  14

In [62]:
pd.concat([df_obj_new,df_obj1], axis=0)
#axis=0: join by  columns
#axis=1: join by rows
# if we don't put any axis paremeter then it will join by colmns

    0   1   2     3     4     5
0   0   1   2   3.0   4.0   5.0
1   6   7   8   9.0  10.0  11.0
2  12  13  14  15.0  16.0  17.0
3  18  19  20  21.0  22.0  23.0
4  24  25  26  27.0  28.0  29.0
5  30  31  32  33.0  34.0  35.0
0   0   1   2   NaN   NaN   NaN
1   3   4   5   NaN   NaN   NaN
2   6   7   8   NaN   NaN   NaN
3   9  10  11   NaN   NaN   NaN
4  12  13  14   NaN   NaN   NaN

In [64]:
# Tramsforming Data:
#1.Dropping Data:
df_obj_new.drop([0,2])

    0   1   2   3   4   5
1   6   7   8   9  10  11
3  18  19  20  21  22  23
4  24  25  26  27  28  29
5  30  31  32  33  34  35

In [65]:
df_obj_new.drop([0,2], axis=1)# this will drop the whole 2nd col

    1   3   4   5
0   1   3   4   5
1   7   9  10  11
2  13  15  16  17
3  19  21  22  23
4  25  27  28  29
5  31  33  34  35

In [67]:
#2.adding Data
Series_obj= Series(np.arange(6))
Series_obj.name="added_variable"
Series_obj

0    0
1    1
2    2
3    3
4    4
5    5
Name: added_variable, dtype: int64

In [71]:
variable_added=DataFrame.join(df_obj_new, Series_obj)
variable_added

    0   1   2   3   4   5  added_variable
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5

In [78]:
added_datatable=pd.concat([variable_added, variable_added], ignore_index= False)
added_datatable

    0   1   2   3   4   5  added_variable
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5
0   0   1   2   3   4   5               0
1   6   7   8   9  10  11               1
2  12  13  14  15  16  17               2
3  18  19  20  21  22  23               3
4  24  25  26  27  28  29               4
5  30  31  32  33  34  35               5

In [79]:
added_datatable=pd.concat([variable_added, variable_added], ignore_index= True)
added_datatable

     0   1   2   3   4   5  added_variable
0    0   1   2   3   4   5               0
1    6   7   8   9  10  11               1
2   12  13  14  15  16  17               2
3   18  19  20  21  22  23               3
4   24  25  26  27  28  29               4
5   30  31  32  33  34  35               5
6    0   1   2   3   4   5               0
7    6   7   8   9  10  11               1
8   12  13  14  15  16  17               2
9   18  19  20  21  22  23               3
10  24  25  26  27  28  29               4
11  30  31  32  33  34  35               5

In [83]:
#sorting data
df_sorted= df_obj_new.sort_values(by=[1], ascending=[False])
df_sorted

    0   1   2   3   4   5
5  30  31  32  33  34  35
4  24  25  26  27  28  29
3  18  19  20  21  22  23
2  12  13  14  15  16  17
1   6   7   8   9  10  11
0   0   1   2   3   4   5

In [ ]:
#grouping data:
#To compare subsets
#To deduce resons why subgroups differ
#To subset your data for your analysis
address